Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་སོ།
en: In a joyful mood, they were happy and delighted.

source: །མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པས་དེའི་ཕྱིར་ཡང་ཚངས་པའི་འཇིག་རྟེན་དུ་མཆོད་པར་བྱ་བའི་ཕྱིར་བཏེག་སྟེ་ཁྱེར་ནས་བཞག་པར་གྱུར་ཏོ།
en: Then once again, Brahmā, lord of the Sahā World, lifted up the jeweled structure and brought it with him to the Brahma realm, where he installed it as an object of worship.

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཡང་དགེ་སློང་དག་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One again addressed the monks:

source: དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་མའི་རུམ་ན་འདུག་པས་ལྷ་དང་མི་ཁྲག་ཁྲིག་ཕྲག་སུམ་ཅུ་རྩ་དྲུག་ཐེག་པ་གསུམ་ལ་ཡོངས་སུ་སྨིན་པར་བྱས་པར་གྱུར་ཏོ།
en: “Monks, in this way, while the Bodhisattva dwelt in his mother’s womb, he ripened 36 million gods and humans within the Three Vehicles.”

source: གང་ཚེ་རྒྱལ་སྲས་སེམས་ཅན་དམ་པ་མ་ཡི་རུམ་གནས་པ།
en: When the Victors’ Son, the Great Being, settled in his mother’s womb,

source: །དེ་ཚེ་ས་འདི་ཚལ་དང་བཅས་པར་རྣམ་པ་དྲུག་ཏུ་གཡོས།
en: The earth with its forests shook in six ways.

source: །གསེར་མདོག་འོད་བཀྱེ་ངན་སོང་ཐམས་ཅད་རྣམ་པར་སྦྱངས་པར་གྱུར།
en: Golden light shone forth and all the lower realms were purified;

source: །ཆོས་ཀྱི་རྒྱལ་པོར་འགྱུར་ཞེས་ལྷ་ཡི་ཚོགས་རྣམས་རབ་ཏུ་དགའ།
en: All the gods joyfully proclaimed, “He will be a Dharma king!”

source: །གཞལ་མེད་ཁང་ཆེན་དབྱིབས་ལེགས་རིན་ཆེན་དུ་མས་རྣམ་པར་སྤྲས།
en: Well shaped and resplendent with many jewels is the great mansion

source: །དེར་ནི་དཔའ་བོ་རྣམ་པར་འདྲེན་པ་ཞུགས་པར་གྱུར་ནས་འདུག །
en: Where the Hero, the Perfect Guide, has ascended and remains.

source: ཙན་དན་དྲི་ཞིམ་མཆོག་གིས་རབ་ཏུ་གང་ཞིང་རྣམ་པར་མཛེས།
en: It is resplendent, filled with exquisitely fragrant sandalwood,

source: །སྟོང་གསུམ་རིན་ཆེན་ཡོངས་བཀང་དེ་ཡི་སྲང་ཕྱེད་རིན་མི་ཆོག །སྟོང་ཆེན་འཇིག་རྟེན་ཁམས་ཀྱང་འོག་ནས་བརྟོལ་བ་བྱས་ནས་ནི།
en: A few grams of which is worth the whole trichiliocosm filled with jewels. Bursting forth from beneath the great trichiliocosm,

source: །ཡོན་ཏན་འབྱུང་བའི་གནས་ཀྱི་པད་མའི་སྙིང་ཁུའི་ཐིགས་པ་བྱུང་།
en: A lotus, which is a mine of good qualities, emerged with a drop of vital energy.

source: །དེ་བཞིན་ཞག་བདུན་བསོད་ནམས་གཟི་བརྗིད་ཚངས་པའི་འཇིག་རྟེན་འཕགས།
en: Within seven days, it reached the world of Brahmā through the power of merit;

source: །དེ་ལས་སྙིང་ཁུའི་ཐིགས་བླངས་ཚངས་པ་རྒྱལ་བའི་སྲས་ལ་འབུལ།
en: Brahmā collected the vital drop and offered it to the Victors’ Son.

source: །བྱང་ཆུབ་སེམས་དཔའ་དཔའ་བོ་ཚངས་པ་འདྲ་བ་མ་གཏོགས་པར།
en: Apart from the Bodhisattva, a mighty hero,

source: །སེམས་ཅན་གང་གིས་དེ་ཟོས་འཇུར་འགྱུར་སེམས་ཅན་རིས་ན་མེད།
en: No being anywhere could digest the drop.

source: །བསྐལ་པ་དུ་མའི་བསོད་ནམས་གཟི་བརྗིད་སྙིང་ཁུའི་ཐིགས་གནས་པ།
en: This drop of vital energy is imbued with the merit of many eons;

source: །དེ་ཟོས་ལུས་དང་སེམས་དང་ཤེས་པ་རྣམ་པར་དག་པར་གྱུར།
en: Whoever consumes it becomes pure in body, mind, and consciousness.

source: །འདྲེན་པ་མཆོད་ཕྱིར་བརྒྱ་བྱིན་ཚངས་པ་འཇིག་རྟེན་སྐྱོང་བ་རྣམས། །བྱང་ཆུབ་སེམས་དཔའི་དྲུང་དུ་རྟག་པར་དུས་གསུམ་རྒྱུན་ཏུ་འོང་།
en: Śakra, Brahmā, and the guardians of the world paid the Bodhisattva three visits In order to make offerings to the Guide.

source: །ཕྱག་བྱས་མཆོད་བྱས་ཆོས་ཀྱི་དམ་པ་དེ་དག་ཐོས་གྱུར་ནས།
en: They prostrated, made offerings, and listened to the sublime Dharma,

source: །བསྐོར་བ་བྱས་ཏེ་ཀུན་ཀྱང་གང་ནས་འོངས་པའི་གནས་སུ་འདོང་།
en: Then they circled around him and returned to their abodes.

source: །འཇིག་རྟེན་ཁམས་རྣམས་ཀུན་ནས་ཆོས་འདོད་བྱང་ཆུབ་སེམས་དཔའ་འོང་།
en: From all worlds and realms came bodhisattvas desiring the Dharma;

source: །འོད་བཀོད་ཁྲིར་གྱུར་རྣམས་ལ་དེ་དག་གནས་པར་ཕན་ཚུན་སྣང་།
en: Sitting on seats of light, they illumined each other.

source: །མཆོག་ཏུ་བྱ་བའི་ཐེག་པ་དམ་པའི་ཆོས་ནི་ཐོས་གྱུར་ནས།
en: Because they heard the sacred Dharma of the Supreme Vehicle,

source: །ཀུན་ཀྱང་དགའ་བའི་སེམས་གྱུར་བསྟོད་པའི་ཕྲེང་བ་བརྗོད་ཅིང་འདོང་།
en: They all could leave with joy, proclaiming songs of praise.

source: །བུད་མེད་བྱིས་པ་གང་དག་སྡུག་བསྔལ་ལྡན་པར་གྱུར་པ་དང་། །འབྱུང་པོས་ནོན་དང་སེམས་འཁྲུགས་གོས་མེད་རྡུལ་གྱིས་ཡོག་པ་རྣམས།
en: Any woman or child afflicted by suffering, Possessed by spirits, with troubled mind, naked and covered with dust,

source: །དེ་ཀུན་ལྷ་མོ་སྒྱུ་འཕྲུལ་མཐོང་ནས་སེམས་ནི་རྙེད་གྱུར་ཏེ།
en: Recovered their senses upon seeing Queen Māyā.

source: །བློ་གྲོས་རྟོགས་དང་དྲན་དང་ལྡན་ཞིང་སོ་སོའི་ཁྱིམ་ཁྱིམ་འདོང་།
en: With intelligence and mindfulness restored, they returned to their homes.

source: །རླུང་དང་བད་ཀན་མཁྲིས་པའི་ནད་དང་འདུས་པའི་ནད་ཐེབས་དང་། །མིག་ནད་རྣ་ནད་དག་གིས་ལུས་སེམས་མི་བདེར་གྱུར་པ་དག །རྣམ་མང་ཐ་དད་ནད་ཀྱི་རྣམ་པས་གང་དག་གནོད་གྱུར་པ། །དེ་དག་སྒྱུ་འཕྲུལ་ལག་པ་མགོ་ལ་བཞག་པས་ནད་མེད་གྱུར།
en: Those afflicted by illness caused by disorders of wind, bile, or phlegm, And those with body and mind tormented by diseases of the eyes and ears, And all those stricken by many different kinds of ailments, Were freed from illness when Queen Māyā placed her hand on their heads.

source: །ཡང་ན་རྩྭ་ཡི་ཉག་མ་འགའ་ཞིག་ས་ལས་བླངས་བྱས་ཏེ།
en: Moreover, gathering herbs from the ground,

source: །སྒྱུ་འཕྲུལ་ནད་པ་བྱིན་ན་ཐམས་ཅད་རིམས་ནད་མེད་པར་གྱུར།
en: Māyā gave them to the sick, who all became cured.

source: །བདེ་བ་ཐོབ་ཅིང་ད་རོད་མ་ཉམས་སོ་སོའི་ཁྱིམ་དུ་འདོང་།
en: Happy and healthy, they returned to their homes,

source: །དེ་ནི་སྨན་གྱུར་སྨན་པའི་རྒྱལ་པོ་རུམ་ན་འདུག་ཕྱིར་རོ།
en: While the King of Physicians, the remedy itself, dwelt in the womb.

source: །གང་ཚེ་ལྷ་མོ་སྒྱུ་འཕྲུལ་བདག་གི་ལུས་ལ་བརྟག་བྱས་པ།
en: Whenever Queen Māyā examined her body,

source: །དེ་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་རུམ་ན་འདུག་པ་མཐོང་བ་ནི།
en: She saw the Bodhisattva in her womb.

source: །ཇི་ལྟར་བར་སྣང་གནས་ཀྱི་ཟླ་བ་སྐར་མས་བསྐོར་གནས་པ།
en: Like the moon in the sky encircled by stars,

source: །དེ་བཞིན་བྱང་ཆུབ་སེམས་དཔའ་མཚན་གྱིས་ཀུན་ནས་བརྒྱན་པ་སྣང་།
en: The Bodhisattva was ornamented by marks.

source: །དེ་ལ་འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་གནོད་པར་འགྱུར་བ་མེད།
en: She was untroubled by attachment, anger, or delusion,

source: །འདོད་ལ་འདོད་པ་དེ་མེད་དེ་ལ་ཕྲག་དོག་འཚེ་བ་མེད།
en: Had no sexual desires, nor envy or ill will.

source: །དགའ་བའི་སེམས་དང་མགུ་བའི་སེམས་དང་དགའ་དང་ཡིད་བདེར་གནས།
en: With a joyful and elated mind, she was blissful,

source: །དེ་ལ་བཀྲེས་དང་སྐོམ་དང་ཚ་དང་གྲང་བའི་གནོད་པ་མེད།
en: Never bothered by hunger and thirst, or heat and cold.

source: །ལྷ་ཡི་རོལ་མོ་སིལ་སྙན་དབྱངས་སྒྲ་མ་བྱས་རྟག་ཏུ་འབྱུང་།
en: The sounds of divine instruments constantly arose without being played.

source: །ལྷ་ཡི་སྤོས་དྲི་མེ་ཏོག་དམ་པ་མཆོག་མཛེས་ཆར་ཡང་འབབ།
en: Excellent sublime flowers, fragrant with divine perfumes, fell like rain.

source: །ལྷ་དང་མི་རྣམས་དེ་ལ་ལྟ་ཞིང་ལྷ་མི་ཐམས་ཅད་ཀྱང་།
en: Gods and humans beheld this, and none of them

source: །དེ་དག་ཕན་ཚུན་གནོད་པ་མེད་ཅིང་འཚེ་བ་གང་ཡང་མེད།
en: Felt any resentment or ill will toward one another.

source: །སེམས་ཅན་དགའ་བདེར་རྩེ་ཞིང་ཟས་དང་སྐོམ་གྱི་སྦྱིན་པ་བྱེད།
en: Beings rejoiced and played, and made offerings of food and drink;

source: །དགའ་བའི་སྒྲ་སྒྲོག་དེ་དག་དགའ་ཞིང་མགུ་བའི་ཡིད་དང་ལྡན།
en: They uttered cries of joy, content and delighted as they were.

source: །རྒྱལ་པོའི་སྲིད་བདེ་འཁྲུག་པ་མེད་ཅིང་ཆར་པ་དུས་བཞིན་འབབ།
en: The kingdom was at peace, undisturbed and with well-timed rain;

source: །རྩྭ་དང་སྨན་དང་མེ་ཏོག་རྣམས་ཀྱང་དེ་ཡི་དུས་སུ་སྐྱེ།
en: Grasses, medicinal herbs, and flowers grew in a timely manner.

source: །རྒྱལ་པོའི་ཁབ་ཏུ་ཞག་བདུན་རིན་ཆེན་ཆར་པ་བབ་གྱུར་པས།
en: Over the royal palace, a rain of jewels fell for seven days;

source: །སེམས་ཅན་དབུལ་པོ་དེ་ལས་ལེན་ཅིང་སྦྱིན་བྱེད་བདེ་བར་སྤྱོད།
en: Impoverished beings brought them home and enjoyed the bounty.

source: །སེམས་ཅན་དབུལ་ཞིང་སྡུག་བསྔལ་གྱུར་པ་དེ་ཚེ་གང་ཡང་མེད།
en: At that time there were no impoverished or suffering beings;

source: །རི་རབ་ཟོམ་གྱི་དགའ་ཚལ་སེམས་ཅན་བཞིན་དུ་དགའ་དང་ལྡན།
en: Everyone was as joyful as the beings in the pleasure grove atop Mount Meru.

source: །ཤཱཀྱའི་རྒྱལ་པོ་དེ་ཡང་གསོ་སྦྱོང་རབ་ལ་ཉེར་གནས་ཤིང་།
en: The king of the Śākyas observed the mending and purification ritual;

source: །དེ་ནི་རྒྱལ་པོའི་བྱ་བ་མི་བྱེད་ཆོས་ལ་རྟག་པར་སྤྱོད།
en: Leaving his royal duties, he only practiced the Dharma.

source: །དེ་ནི་དཀའ་ཐུབ་ནགས་ཚལ་སོང་ནས་ལྷ་མོ་སྒྱུ་འཕྲུལ་ལ།
en: He went into the grove of the ascetics and said to Māyādevī,

source: །སེམས་ཅན་མཆོག་སྲེལ་ཁྱོད་ཀྱི་ལུས་ལ་བདེ་བ་ཅི་འདྲ་རྨེད།
en: “How blissful your body must be, bearing the Perfect Being!”

source: །ལྷུམས་སུ་འཇུག་པའི་ལེའུ་སྟེ་དྲུག་པའོ།། །།
en: This concludes the sixth chapter, on entering the womb.

source: དགེ་སློང་དག་དེ་ལྟར་ཟླ་བ་བཅུ་འདས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་བཙའ་བའི་དུས་ལ་བབ་པ་དང་། རྒྱལ་པོ་ཟས་གཙང་མའི་སྐྱེད་མོས་ཚལ་དུ་སྔ་ལྟས་སུམ་ཅུ་རྩ་གཉིས་བྱུང་ངོ་། །
en: Monks, in this way ten months passed, and the time came for the Bodhisattva to take birth.

source: སུམ་ཅུ་རྩ་གཉིས་གང་ཞེ་ན།
en: At that time thirty-two omens occurred in King Śuddhodana’s parks:

source: མེ་ཏོག་ཐམས་ཅད་ཁ་འབུས་ནས་རྒྱས་པར་གྱུར་པ་དང་། རྫིང་དག་ན་མེ་ཏོག་ཨུད་པལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་ཡོད་པ་དག་ཀྱང་ཁ་འབུས་ནས་རྒྱས་པར་གྱུར་པ་དང་། མེ་ཏོག་དང་འབྲས་བུའི་ཤིང་ལྗོན་པ་གསར་པ་དག་ཀྱང་ས་ལས་འཐོན་ཏེ་ཁ་འབུས་ནས་རྒྱས་པར་གྱུར་པ་དང་། རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་བརྒྱད་བྱུང་བ་དང་། གཏེར་ཆེན་པོ་ཉི་ཁྲི་འབུས་ཏེ་བྱུང་ནས་གནས་པར་སྣང་བ་དང་། ཁྱིམ་གྱི་ནང་དུ་ཡང་རིན་པོ་ཆེའི་མྱུ་གུ་འཐོན་པ་དང་སྤོས་ཆུའི་དཔལ་གྱི་ཝ་འབྲུ་མར་དྲི་ཞིམ་པོས་སྦགས་པ་རྣམས་ཀྱང་ཟག་པར་གྱུར་པ་དང་། གངས་ཀྱི་རིའི་ངོས་ལས་སེང་གེའི་ཕྲུ་གུ་དག་འོངས་ཏེ།
en: All flowers budded and blossomed. In the ponds, all the blue, red, and white lotus flowers also budded and blossomed. New fruit and flower trees sprung from the earth, budded, and came into blossom. Eight trees of precious gems appeared. Twenty thousand great treasures emerged and remained on the grounds.

source: དགའ་བར་རྩེ་ཞིང་སེར་སྐྱའི་གྲོང་ཁྱེར་དམ་པ་ལ་བསྐོར་བ་བྱས་ནས་སྒོ་ན་གནས་པར་གྱུར་ཀྱང་སེམས་ཅན་གང་ལ་ཡང་འཚེ་བ་མེད་པར་གྱུར་པ་དང་། གླང་པོའི་ཕྲུ་གུ་ཐལ་ཀར་ལྔ་བརྒྱ་ལྷགས་ཏེ། རྒྱལ་པོ་ཟས་གཙང་མའི་རྐང་པ་ལ་སྣའི་རྩེ་མོས་ཉུག་ཅིང་གནས་པར་གྱུར་པ་དང་། ལྷའི་བྱིས་པ་རོགས་པ་སྐ་རགས་བཅིངས་པ་དག་ཀྱང་རྒྱལ་པོ་ཟས་གཙང་མའི་བཙུན་མོའི་འཁོར་གྱི་པང་པ་ནས་པང་པ་དག་ཏུ་འགྲེ་ལྡོག་པར་སྣང་བར་གྱུར་པ་དང་། ཀླུའི་བུ་མོ་མཆོད་པ་སྣ་ཚོགས་ཀྱི་ཡོ་བྱད་ཐོགས་པ་དག་ཀྱང་ལུས་ཕྱེད་ཕྱུང་ཞིང་ནམ་མཁའ་ལ་རྒྱུ་བར་སྣང་བ་དང་། ལྷའི་བུ་མོ་ཁྲི་ཡང་རྨ་བྱའི་མདོངས་ལག་ན་ཐོགས་ཤིང་ནམ་མཁའ་ལ་འཁོད་པར་སྣང་བ་དང་། བུམ་པ་གང་བ་ཁྲི་ཡང་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ལ་སྐོར་བ་བྱེད་པར་སྣང་བ་དང་། ལྷའི་བུ་མོ་ཁྲི་ཡང་སྤོས་ཆུའི་རིལ་བ་བྲིང་ག་ར་གླད་ལ་ཐོགས་ཤིང་འཁོད་པར་སྣང་བ་དང་། ལྷའི་བུ་མོ་ཁྲི་ཡང་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་ཐོགས་ཤིང་འཁོད་པར་སྣང་བ་དང་། ལྷའི་བུ་མོ་བརྒྱ་སྟོང་མང་པོ་དག་ཀྱང་དུང་དང་། རྔ་དང་། རྫ་རྔ་དང་། ཁར་རྔ་མགུལ་ནས་སྤྱངས་ཏེ་སྡོད་ཅིང་འཁོད་པར་སྣང་བ་དང་། རླུང་ཐམས་ཅད་ཀྱང་མི་ལྡང་བར་གནས་པར་གྱུར་པ་དང་། ཆུ་ཀླུང་དང་ཆུ་བྲན་ཐམས་ཅད་ཀྱང་མི་འགུལ་ཞིང་མི་འབབ་པར་གྱུར་པ་དང་། ཉི་ཟླ་དང་། གཞལ་མེད་ཁང་དང་། རྒྱུ་སྐར་དང་། སྐར་མའི་ཚོགས་རྣམས་ཀྱང་མི་རྒྱུ་བར་གྱུར་པ་དང་། སྐར་མ་རྒྱལ་དང་ཡང་ལྡན་པར་གྱུར་པ་དང་། རྒྱལ་པོ་ཟས་གཙང་མའི་ཁྱིམ་ཡང་རིན་པོ་ཆེའི་དྲ་བས་ཡོག་པར་གྱུར་པ་དང་། མེ་ཡང་མི་འབར་བར་གྱུར་པ་དང་། ཁང་པ་བརྩེགས་པ་དང་། ཁང་བཟངས་དང་། ཡང་ཐོག་དང་། རྟ་བབས་དག་ལའང་ནོར་བུ་དང་། རིན་པོ་ཆེ་དག་འཕྱང་བར་སྣང་བར་གྱུར་པ་དང་། རས་བཅོས་བུའི་མཛོད་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མཛོད་རྣམས་ཀྱང་སྒོ་བྱེ་བར་སྣང་བ་དང་། བྱ་རོག་དང་། འུག་པ་དང་། བྱ་རྒོད་དང་། སྤྱང་ཀི་དང་། ཝའི་སྒྲ་དག་ཀྱང་མེད་པར་གྱུར་པ་དང་། སྒྲ་སྐད་སྙན་པའི་སྒྲ་དག་ཀྱང་འབྱུང་བར་གྱུར་པ་དང་། སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་ལས་ཀྱི་མཐའ་འང་རྒྱུན་ཆད་པར་གྱུར་པ་དང་། སའི་ཕྱོགས་མཐོན་དམན་དུ་འདུག་པ་རྣམས་ཀྱང་མཉམ་པར་གནས་པར་གྱུར་པ་དང་། ལམ་གྱི་བཞི་མདོ་དང་། སུམ་མདོ་དང་། སྲང་དང་། ཚོང་འདུས་ཀྱི་འཁོར་ཀྱང་ལག་མཐིལ་ལྟར་གཞི་མཉམ་ཞིང་འཇམ་ལ་མེ་ཏོག་སིལ་མས་གང་སྟེ་མཛེས་པར་སྣང་བ་དང་། སྦྲུམ་པ་ཐམས་ཅད་ཀྱང་བདེ་བ་དང་། ལེགས་པར་བཙའ་བར་གྱུར་པ་དང་། ཤིང་སཱ་ལའི་ནགས་ཚལ་གྱི་ལྷ་ཐམས་ཅད་ཀྱང་ཤིང་གི་ལོ་མའི་ནང་ནས་ལུས་ཕྱེད་ཕྱུང་སྟེ། ཕྱག་འཚལ་ཞིང་གནས་པར་སྣང་བ་སྟེ།
en: Inside the women’s quarters, jeweled shoots sprouted forth. Scented water, saturated with fragrant oils, flowed forth. Lion cubs descended from the snow mountains. They joyfully circled the sublime city of Kapilavastu and then rested by the gates without harming anyone. Five hundred young white elephants arrived, stroking King Śuddhodana’s feet with the tips of their trunks, and then settling down next to him. Divine children, wearing sashes, were seen moving back and forth between the laps of the women in the retinue of King Śuddhodana’s queen. Nāga girls could be seen holding aloft various offerings, revealing the upper half of their bodies as they moved about in the sky. Ten thousand celestial maidens were seen hovering in the sky, holding up peacock feathers. Ten thousand full vases appeared in a ring around the city of Kapilavastu. Ten thousand celestial maidens appeared with vases of scented water on their heads. Ten thousand celestial maidens appeared holding up parasols, flags, and banners. Many hundreds of thousands of celestial maidens appeared holding conch shells, drums, clay drums, and cymbals adorned with bells. The winds became still and ceased to blow. All streams and rivers stopped their flow. The sun, the moon, the celestial chariots, the planets, and the stars all stood still. The constellation of Puṣya appeared. King Śuddhodana’s residence became adorned with a net of jewels. All fires were extinguished. The palace, temples, gateways, and doorways were decorated with tassels of jewels and gems. The doors to the storehouses of cloths and gems appeared wide open. The calls of crows, owls, vultures, wolves, and jackals ceased to be heard. Instead many delightful sounds were heard. All people stopped their work. The ground became level without any bumps or hollows. All crossroads, junctions, roads, and marketplaces became as even and smooth as the palm of a hand and were beautifully bestrewn with flower petals. All pregnant women birthed their babies with comfort and ease. All the gods in the sāl forest revealed half their bodies from among the trees’ leaves and remained there, bowing.

source: སྔ་ལྟས་སུམ་ཅུ་རྩ་གཉིས་པོ་དེ་དག་བྱུང་བར་གྱུར་ཏོ།
en: Such were the thirty-two omens that occurred.

source: །དེ་ནས་ལྷ་མོ་སྒྱུ་འཕྲུལ་བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཀྱི་གཟི་བརྗིད་དང་མཐུས་བྱང་ཆུབ་སེམས་དཔའ་བཙའ་བའི་དུས་ལ་བབ་པར་ཤེས་ཏེ།
en: Then Māyādevī, due to the magnificence and strength of the Bodhisattva, knew that it was time for her to give birth.

source: ནམ་གྱི་སྲོད་ལ་རྒྱལ་པོ་ཟས་གཙང་མའི་དྲུང་དུ་འོངས་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: During the first watch of the night, she came to King Śuddhodana and spoke these words:

source: བདག་གི་བསམ་པ་གང་ལགས་གསོལ་གྱིས་ལྷ་ནི་གསན་དུ་གསོལ།
en: “Lord, please listen to what is on my mind:

source: །ཡུན་རིང་རིང་པོ་འདས་ནས་སྐྱེད་མོས་ཚལ་གྱི་བློ་སྐྱེས་ཏེ།
en: For a long time now, I have thought about the pleasure grove.

source: །གལ་ཏེ་ཁྱོད་མི་བཀྱོན་ཅིང་ཞེ་སྡང་ཕྲག་དོག་མི་མངའ་ན།
en: If you will not be upset, displeased, or envious,

source: །བདག་ནི་རྩེ་ནས་སྐྱེད་མོས་ཚལ་དུ་མྱུར་དུ་མཆི་བར་བགྱི།
en: I should quickly go to that pleasure grove.

source: །ཆོས་དགོངས་བརྩོན་པ་དཀའ་ཐུབ་སྤྱོད་པས་ཁྱོད་ཀྱང་སྐྱོན་མཁྱེན་གྲང་།
en: “You are also weary from austerities and diligently contemplating the Dharma;

source: །བདག་ཀྱང་སེམས་ཅན་དག་པ་བསྲེལ་ནས་ཡུན་ནི་རིང་ལགས་ལ།
en: I myself have carried a pure being within me for a long time now.

source: །སཱ་ལའི་ཤིང་ལྗོན་སྡོང་པོ་མཆོག་ཀྱང་མེ་ཏོག་ཁ་འབུས་ཏེ།
en: The sāl, that most wonderful of trees, is now in blossom.

source: །སྐྱེད་མོས་ཚལ་གྱི་དོག་སར་ད་ནི་མཆི་བའི་རིགས་སོ་ལྷ།
en: O Lord, it is therefore fitting for us to go to the pleasure grove!

source: །སོས་ཀའི་དུས་མཆོག་བུད་མེད་རྣམས་ཀྱི་རྒྱན་དུ་གྱུར་ལགས་ཏེ།
en: “Spring, that excellent season, is a joyous time for women;

source: །ནགས་རྒྱུ་ཁུ་བྱུག་དང་ནི་རྨ་བྱ་སྒྲ་རབ་སྙན་པ་འབྱིན།
en: The bees are humming and the cuckoos singing.

source: །གཙང་ཞིང་མཛེས་ལ་སྣ་ཚོགས་མེ་ཏོག་རྡུལ་གྱི་ངད་ཀྱང་ལྡང་།
en: Fresh and sweet, the fragrance of flowers drifts through the air—

source: །ད་ནི་མཆི་ན་མ་ཐོགས་ལེགས་པར་བཀའ་ལུང་སྩལ་དུ་གསོལ།
en: Please issue an order, and let us go there right away!”

source: །རྒྱལ་པོའི་དབང་པོས་ལྷ་མོ་ལས་ནི་དེ་སྐད་ཚིག་ཐོས་ནས།
en: The king heard Māyādevī’s words, and then,

source: །དགའ་ཞིང་རབ་ཏུ་མགུ་བའི་སེམས་ཀྱིས་འཁོར་ལ་སྨྲས་པ་ནི།
en: Delighted and elated, he spoke to his retinue:

source: །བཞོན་པ་བཞོན་ཆེ་མགྱོགས་པའི་ཤུགས་ལྡན་དག་ཀྱང་བསྟད་པར་གྱིས།
en: “Arrange my horses, elephants, and chariots!

source: །ཡོན་ཏན་ཕུན་སུམ་ཚོགས་ལྡན་ལུམ་བི་ནི་ཚལ་བརྒྱན་པར་གྱིས། །
en: Decorate the excellent garden at Lumbinī!

source: རི་སྔོའི་མདོག་ལྡན་སྤྲིན་གྱི་ཁ་དོག་འཐུན་པར་གྱུར་པ་ཡི། །གླང་པོ་སྟོང་ཕྲག་ཉི་ཤུ་སྙེད་ཅིག་མྱུར་དུ་བསྟད་པར་གྱིས།
en: “Quick, prepare twenty thousand elephants, Dark blue like mountains or storm clouds.

source: །གླང་པོའི་དབང་པོ་མཆེ་བ་དྲུག་ལྡན་དྲིལ་མཛེས་གློ་ལ་བརྒྱུས།
en: Ornament the lordly six-tusked elephants with bells attached to their flanks;

source: །གསེར་དང་ནོར་བུས་རྣམ་པར་སྤྲས་ཤིང་གསེར་གྱི་དྲ་བས་སྤུད།
en: Decorate them with gold and gems and cover them with lattices of gold.

source: །རྒྱལ་པོའི་བཅིབས་པ་རླུང་ལྟར་མགྱོགས་པའི་ཤུགས་དང་ལྡན་པ་སྟེ། །དངུལ་དང་ཁ་བའི་མདོག་འདྲ་རྔ་རྔོག་ལྕང་ལོ་བཟང་འཁྲིལ་བའི། །རྟ་མཆོག་སྟོང་ཕྲག་ཉི་ཤུ་བགྲངས་པ་མྱུར་དུ་སྟོང་གྱིས་ཏེ། །གསེར་དྲིལ་གཡེར་ཀའི་དྲ་བ་གློ་ནས་སྦྱང་བ་གྱིས།
en: “Quick, harness twenty thousand royal steeds, Fast as the wind, strong and excellent steeds, With silvery snow-colored tails, manes that are beautifully plaited, And lattices of golden bells hung on their flanks.

source: །སྐྱེས་བུ་རྟུལ་ཕོད་གཡུལ་ལ་མོས་ཤིང་འཐབ་འདོད་དཔའ་བོ་དག །མདའ་གཞུ་རལ་གྲི་མདུང་ཐུང་ཞགས་པ་མཚོན་ཆ་རྣོ་ཐོགས་པ། །
en: “Quick, gather twenty thousand brave men, Heroes who long for the battlefield and combat.

source: སྟོང་ཕྲག་ཉི་ཤུ་བགྲངས་པ་མྱུར་དུ་ཆོས་ཏེ་བཤམ་གྱིས་ལ།
en: Let them brandish sharp weapons—bows and arrows, swords, spears, and lassos—

source: །སྒྱུ་འཕྲུལ་འཁོར་དང་བཅས་པ་བག་ཡོད་པར་ནི་བསྲུང་བར་གྱིས།
en: To carefully guard Māyādevī and her retinue.

source: །ལུམ་བི་ནི་དེར་གསེར་དང་ནོར་བུའི་རྒྱན་ཁྲོམ་བརྒྱན་པར་གྱིས།
en: “Have Lumbinī bestrewn with gold and jewels;

source: །གོས་དམར་རྣམ་པ་མང་པོས་ཤིང་རྣམས་ཐམས་ཅད་བརྒྱན་པར་གྱིས།
en: Adorn all the trees with many types of cloths and jewels.

source: །ལྷ་ཡི་དགའ་ཚལ་བཞིན་དུ་མེ་ཏོག་སྣ་ཚོགས་ཆལ་པར་ཁྲོམ།
en: Quick, plant many flowers, like in the gardens of the gods.

source: །དེ་ལྟར་ཐམས་ཅད་བཤམས་ཟིན་མྱུར་དུ་ང་ལ་སྦྲན་པར་གྱིས།
en: Arrange all of this, and then swiftly report to me.”

source: །འཁོར་རྣམས་ཀྱིས་ནི་དེ་སྐད་ཚིག་ཐོས་སྐད་ཅིག་ཏུ།
en: Hearing this, the retinue immediately arranged

source: །བཞོན་པ་ཀུན་བཤམས་དེ་བཞིན་ལུམ་བི་ནི་ཡང་བརྒྱན་བྱས་ཏེ། །རྒྱལ་གྱུར་རྒྱལ་གྱུར་སྐུ་ཚེ་རིང་སྐྱོངས་རྒྱལ་པོ་གཤེགས་སུ་གསོལ།
en: All the conveyances and ornamented Lumbinī. They then called out, “Victory! Victory! Long live the king!

source: །ཇི་སྐད་བཀའ་སྩལ་དེ་བཞིན་ཀུན་བགྱིས་དུས་བབ་ལྷ་གཟིགས་ཤིག །མི་ཡི་བདག་པོ་དམ་པ་དེ་ཡང་དགའ་བའི་སེམས་གྱུར་ནམ།
en: Your command is fulfilled and all is ready. Please look, O lord!” The sublime lord of men, with a joyous mind,

source: །ཁྱིམ་གྱི་དམ་པར་ཞུགས་ཏེ་བུད་མེད་རྣམས་ལ་འདི་སྐད་སྨྲས།
en: Entered the palace and spoke thus to the women:

source: །གང་ཞིག་ང་ལ་སྙིང་ཉེ་ང་ལ་དགའ་བར་འདོད་པ་དག །ང་ཡི་བཀའ་བཞིན་གྱིས་ཏེ་བདག་གི་ལུས་ཀུན་བརྒྱན་པར་གྱིས།
en: “Those of you to whom I am dear and who would like to bring me joy, Follow my command and adorn yourselves.

source: །སྤོས་མཆོག་ངད་ཀྱི་དྲི་ཞིམ་ཁ་དོག་སྣ་ཚོགས་སྡུག་པའི་གོས། །འཇམ་ཞིང་ཡིད་འོང་དགའ་བའི་སེམས་ཀྱིས་ལེགས་པར་བགོ་བར་གྱིས། །བྲང་ན་འཕྱང་བའི་མུ་ཏིག་སེ་མོ་དོ་ཡིས་བརྒྱན་པར་གྱིས། །རྒྱན་གྱི་ཁྱད་པར་ཐམས་ཅད་དེ་རིང་ཀུན་གྱིས་བསྟན་པར་གྱིས། །
en: “With colorful clothes, beautiful and soft, And fragrant with enchanting perfume, Adorn your chests with necklaces of pearls; Today everyone should wear all their ornaments!

source: ཁར་རྔ་རྒྱུད་གཅིག་གླིང་བུ་པི་ཝང་རྫ་རྔ་དུམ་དུམ་ཕེག །སིལ་སྙན་ཡིད་དུ་འོང་བ་བརྒྱ་སྟོང་དག་ཀྱང་བཤམ་པར་གྱིས།
en: “Bring hundreds of thousands of delightful instruments: Hand drums, flutes, lutes, clay drums, and cymbals.

source: །སྒྲ་སྙན་ཐོས་ནས་ལྷ་རྣམས་རབ་ཏུ་དགའ་བ་སྐྱེ་འགྱུར་ཞིང་།
en: Hearing the melodious sound of these instruments, even the gods will be pleased!

source: །ལྷ་མོ་རྣམས་ཀྱང་དེ་བཞིན་དགའ་བར་འགྱུར་བ་ཁྱེད་ཀྱིས་གྱིས།
en: You make the goddesses similarly joyful!

source: །ཤིང་རྟའི་མཆོག་འདིར་ལྷ་མོ་སྒྱུ་འཕྲུལ་གཅིག་པུ་འདུག་པར་གྱིས།
en: “In the supreme chariot, only Māyādevī shall sit;

source: །བུད་མེད་སྐྱེས་པ་གཞན་དག་སུ་ཡང་ཤིང་རྟ་དེར་མ་འཁོད།
en: None of the ladies nor the men shall join her.

source: །ན་ཆུང་སྣ་ཚོགས་གོ་ཅན་རྣམས་ཀྱིས་ཤིང་རྟ་དེ་དྲོངས་ཏེ།
en: This chariot shall be led by a host of bright young women;

source: །གང་དུའང་ཡིད་དུ་མི་འོང་མི་འཐུན་སྒྲ་རྣམས་མི་གྲགས་ཀྱིས།
en: No one shall mention anything unpleasant or unfitting!”

source: །ལྷ་མོ་སྒྱུ་འཕྲུལ་ཁྱིམ་ནས་བྱུང་སྟེ་སྒོ་དྲུང་ཕྱིན་པའི་ཚེ།
en: Māyādevī then left her palace and went to the door of the king.

source: །རྟ་དང་གླང་པོ་ཤིང་རྟ་རྐང་ཏང་དཔལ་ལྡན་སྣ་ཚོགས་དཔུང་།
en: When she arrived, the divisions of horses, elephants, chariots, and foot soldiers

source: །རྒྱལ་པོའི་སྒོ་དྲུང་ལྷགས་ཚེ་སྒྲ་ཆེན་མང་པོ་གྲག་པར་གྱུར།
en: All called out with a deafening roar,

source: །རྒྱ་མཚོ་ཆེན་པོ་འཁྲུགས་པའི་སྒྲ་ལྟར་དེ་དག་ཡོངས་སུ་གྲག །དེ་ཚེ་བཀྲ་ཤིས་དོན་དུ་དྲིལ་བུ་བརྒྱ་སྟོང་དཀྲོལ་བར་བྱས།
en: As loud as the waves on a great turbulent ocean. At this moment, auspiciously, a hundred thousand bells rang out.

source: །ཤིང་རྟ་དེ་ཡང་དེ་ལྟར་རྒྱལ་པོས་སྣ་ཚོགས་བརྒྱན་པ་ལ།
en: The king himself decorated the chariot,

source: །ལྷ་རྣམས་སྟོང་གིས་ལྷ་ཡི་ཁྲི་ཡང་ལེགས་པར་བཤམ་པ་བྱས།
en: And a thousand gods prepared a divine throne.

source: །རིན་ཆེན་ཤིང་ལྗོན་མེ་ཏོག་ལོ་མ་ལྡན་བཞིན་ལྡན་པར་བྱས།
en: The four precious trees were complete with flowers and leaves.

source: །རྨ་བྱ་ཁྲུང་ཁྲུང་ངང་པ་ཡིད་དུ་འོང་བའི་སྒྲ་ཡང་འབྱིན།
en: Peacocks, cranes, and swans sounded their delightful calls;

source: །གདུགས་དང་རྒྱལ་མཚན་བ་དན་ཆེ་ཕྲ་ཀུན་ནས་འཁོར་བར་བསྒྲེང་།
en: Parasols, flags, and banners of all sizes were hoisted;

source: །ལྷ་ཡི་གོས་དང་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་མཆོག་གིས་བཀབ།
en: The chariot was covered with a beautiful lattice of tinkling bells and divine cloth.

source: །ལྷ་ཡི་བུ་མོ་ནམ་མཁའ་ལས་ནི་ཤིང་རྟ་དེ་ལ་ལྟ།
en: From up in the heavens, celestial maidens looked down at the chariot;

source: །ལྷ་ཡི་སྒྲ་དབྱངས་སྙན་པ་སྒྲོག་ཅིང་བསྟོད་པའི་ཚིག་བརྗོད་དེ།
en: They called out in divine melodious tones, offering words of praise.

source: །གང་ཚེ་ལྷ་མོ་སྒྱུ་འཕྲུལ་སེང་གེའི་ཁྲི་ལ་འདུག་གྱུར་པ།
en: When Māyādevī sat upon the lion throne,

source: །དེ་ཚེ་སྟོང་གསུམ་ས་འདི་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས།
en: The earth of the trichiliocosm trembled in six ways.

source: །ལྷ་རྣམས་གོས་ཀྱི་གཡབ་མོ་འབྱིན་ཅིང་མེ་ཏོག་སྣ་ཚོགས་འཐོར།
en: The gods waved cloths and scattered a rain of flowers:

source: །དེ་རིང་ལུམ་བི་ནི་འདིར་འགྲོ་བའི་དམ་པ་བལྟམ་གྱུར་ཏེ།
en: “Today at Lumbinī, a sublime being is to be born!”

source: །འཇིག་རྟེན་སྐྱོང་བ་བཞི་ནི་ཤིང་རྟའི་མཆོག་དེ་འདྲེན་པར་བྱེད།
en: The four guardians of the world led the supreme chariot;

source: །སུམ་ཅུ་རྩ་གསུམ་བདག་པོ་དབང་པོའང་ལམ་གྱི་བྱི་དོར་བྱེད།
en: Śakra himself, lord of the Heaven of the Thirty-Three, cleared its path.

source: །ཚངས་པ་སྐྱེ་བོ་མི་སྲུན་སེལ་ཅིང་སྔོན་དུ་འགྲོ་བར་གྱུར།
en: Brahmā, going ahead, expelled all untamed creatures;

source: །ལྷ་རྣམས་བརྒྱ་ཕྲག་སྟོང་ཡང་ཐལ་མོ་སྦྱར་བས་ཕྱག་འཚལ་འདུད།
en: Hundreds of thousands of gods joined their hands and bowed down.

source: །རྒྱལ་པོ་རབ་ཏུ་དགའ་བའི་སེམས་ཀྱིས་བཀོད་པ་དེ་ལ་ལྟ།
en: The king, with a joyful heart, surveyed what had been prepared,

source: །དེ་ནི་འདི་སྙམ་འདི་ནི་ལྷ་ཡི་ལྷ་ཞིག་ཡིན་སྙམ་བྱེད།
en: Thinking, “This child must be the god of gods!

source: །གང་ལ་སྐྱོང་བ་བཞི་དང་ཚངས་པ་དབང་པོར་བཅས་པའི་ལྷ། །མཆོད་པ་རྒྱ་ཆེན་བྱེད་པ་འདི་ནི་ངེས་པར་སངས་རྒྱས་འགྱུར།
en: When the four guardians, Brahmā, and the gods, led by Śakra, make such offerings, He will surely become a buddha!

source: །སྲིད་པ་གསུམ་ན་ལྷ་ཀླུ་བརྒྱ་བྱིན་ཚངས་པ་འཇིག་རྟེན་སྐྱོང་། །གང་ཡང་མཆོད་པ་འདི་འདྲ་བཟོད་པའི་སེམས་ཅན་དེ་མེད་དེ།
en: “None of the gods, nor the nāgas, Śakra, Brahmā, or the guardians of the world, Nor any other being in the trichiliocosm could accept such offerings as these,

source: །ཡང་ན་མགོ་འགས་ཡང་ན་དེ་དག་སྲོག་དང་བྲལ་བར་འགྱུར།
en: For their heads would burst asunder or their lives be lost.

source: །འདི་ནི་ལྷ་ཡི་དམ་པ་ཡིན་པས་མཆོད་པ་ཐམས་ཅད་བཟོད།
en: Yet he, supreme among gods, can accept all offerings.”
